#+title: Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* An谩lisis de la integraci贸n de Rust en el kernel de Linux

- Tema presentado por :: Alonso vila y Samuel Medina
- Calificaci贸n global :: 8.45

|------------------------+------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Peso | Evaluaci贸n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                    9.2 |  0.3 |               8.13 |  0.7 |    8.45 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Evaluaci贸n grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 1 | 0 | 0 | 1 | 3 |  8.00 |
| Nivel        | 0 | 0 | 0 | 2 | 3 |  9.20 |
| Relevancia   | 0 | 0 | 0 | 0 | 5 | 10.00 |
| Claridad     | 0 | 0 | 0 | 2 | 3 |  9.20 |
| Presencia    | 0 | 0 | 0 | 1 | 4 |  9.60 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.20 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros
Ning煤n comentario.

* Evaluaci贸n por parte del docente

| *Aspecto*              | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |            5 |       1. |
| Contenido              |    0.2 |           10 |       2. |
| Fuentes bibliogr谩ficas |    0.1 |          7.5 |     0.75 |
| Uso del tiempo         |    0.1 |          7.5 |     0.75 |
| Dominio del tema       |   0.15 |           10 |      1.5 |
| Presencia              |   0.15 |          7.5 |    1.125 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.13 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- No me enviaron el material a revisi贸n antes de la versi贸n definitiva de
  su exposici贸n 
- El nivel de tu voz es un poco bajo, cuesta un poco seguir lo que vas
  narrando.
- Me gust贸 mucho el tema elegido y el nivel de la exposici贸n. 隆Muy bien! 
- Quisiera hacer una peque帽a correcci贸n a lo que comentan como
  conclusiones: Rust y C son /igualmente capaces/ de controlar
  perfectamente, bit a bit, los contenidos de una regi贸n de memoria que
  est茅n administrando. Si el desarrollo de Linux fuera a iniciarse hoy,
  /muy probablemente/ se har铆a en Rust (y ya hay varios sistemas operativos
  como prueba desarrollados completamente en Rust). Sin embargo, no se est谩
  planteando una reescritura del c贸digo existente en C porque Linux es un
  proyecto muy grande y maduro, y plantearse una reescritura no tiene mucho
  sentido.

  Los desarrolladores de Linux aceptaron, por ahora, la existencia de
  c贸digo en Rust en /regiones perif茅ricas/ del kernel, prohibiendo
  expl铆citamente las reescrituras. Puede que cambie a futuro, o que se
  mantenga as铆 a largo plazo.
